import React from 'react';
import {View, Text, StyleSheet} from 'react-native';
import {ScrollView} from 'react-native-gesture-handler';
import {Header} from '../components/Header';
import {globalStyle} from '../globalStyle';

export const TermsOfServiceScreen = () => {
  return (
    <>
      <Header />
      <ScrollView>
        <View style={styles.container}>
          <Text style={styles.appName}>ЭЛЕКТРОМОНТАЖ</Text>
          <Text style={styles.screenTitle}>
            WWW.EMONTAJ.MN САЙТЫН ҮЙЛЧИЛГЭЭНИЙ НӨХЦӨЛ, ХҮРГЭЛТИЙН ЖУРАМ
          </Text>
          <Text style={styles.heading}>1. Ерөнхий нөхцөл </Text>
          <Text style={styles.paragraph}>
            1.1 WWW.EMONTAJ.MN нь “ЭНДЛЕСС ЭНЕРЖИ” ХХК-ний албан ёсны онлайн
            дэлгүүр бөгөөд энэхүү нөхцөл, журам нь онлайн захиалга, хүргэлт
            хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.
          </Text>
          <Text style={styles.paragraph}>
            1.2 Энэхүү журмын хэрэгжилтэд “ЭНДЛЕСС ЭНЕРЖИ” ХХК /цаашид
            байгууллга гэх/ болон ХЭРЭГЛЭГЧ /цаашид хэрэглэгч гэх/ хамтран
            хяналт тавина.
          </Text>
          <Text style={styles.paragraph}>
            1.3 Хэрэглэгч нь захиалга өгч, хүргэлт хийлгэхээсээ өмнө хүлээн
            зөвшөөрч баталгаажуулсны үндсэн дээр хэрэгжинэ.
          </Text>
          <Text style={styles.paragraph}>
            1.4 Энэхүү Үйлчилгээний нөхцөл нь цахим орчинд бараа бүтээгдэхүүн,
            үйлчилгээг худалдах, худалдан авахтай холбоотой үүсч буй харилцааг
            зохицуулна
          </Text>
          <Text style={styles.heading}>2. Хэрэглэгч болон бүртгүүлэх</Text>
          <Text style={styles.paragraph}>
            2.1 Онлайн дэлгүүрээр үйлчлүүлэх буюу худалдан авалт хийхийг хүссэн
            хэрэглэгч насанд хүрсэн хүн байх бөгөөд WWW.EMONTAJ.MN гишүүнээр
            бүртгүүлсэн байх ёстой.
          </Text>
          <Text style={styles.paragraph}>
            2.2 Хэрэглэгч WWW.EMONTAJ.MN-д гишүүнээр бүртгүүлэхийн тулд
            шаардлагатай мэдээллийг үнэн зөв бөглөсөн байх ба нэр, нас, хүйс,
            утасны дугаар. имэйл хаяг, нууц үгийг оруулна. Гишүүдийн
            мэдээлэллийг нууц байлгах ба нууцлалыг байгууллага бүрэн хариуцна.
          </Text>
          <Text style={styles.paragraph}>
            2.3 Хэрэглэгчийн мэдээллийн үнэн зөв, бодит байдалд хэрэглэгч бүрэн
            хариуцлага хүлээнэ.
          </Text>
          <Text style={styles.paragraph}>
            2.4 Шинээр гишүүн болмогц тухайн хэрэглэгчид нэрийн данс ба түүх
            үүснэ. Дансанд худалдан авалтын түүх, хүргэсэн хаяг, худалдан
            авалтын биелэлт зэрэг багтана.
          </Text>
          <Text style={styles.paragraph}>
            2.5 Хэрэглэгч нэгэн зэрэг хэдэн ч худалдан авалт хийж болох бөгөөд
            худалдан авалтын тоо хэмжээ, үнийн дүнд хязгаарлалт байхгүй.
          </Text>
          <Text style={styles.paragraph}>
            2.6 Хэрэглэгчээр бүртгүүлснээр бараа бүтээгдэхүүн, үйлчилгээ
            захиалах, хүслийн жагсаалт үүсгэх, өөрийн захиалгыг хянах эрхтэй
            болно.
          </Text>
          <Text style={styles.heading}>3. Захиалгын хүргэлт</Text>
          <Text style={styles.paragraph}>
            3.1 Хэрэглэгчийн захиалгын дүн 500мянган төгрөгөөс дээш тохиолдолд
            үнэ төлбөргүй хүргэж өгнө. Захиалгын дүн 500мянган төгрөгөөс доош
            тохиолдолд доорхын дагуу хүргэгдэнэ.
          </Text>
          <Text style={styles.paragraph}>А бүсийн тойрогт - 5000₮</Text>
          <Text style={styles.paragraph}>Б бүсийн тойрогт - 10000₮</Text>
          <Text style={styles.paragraph}>С бүсийн тойрогт - 20000₮</Text>
          <Text style={styles.paragraph}>
            3.2 Хэрэглэгч хүргэлт авахгүй захиалга өгсөн бол өөрийн биеэр дараах
            байршил бүхий газруудаас ирж захиалсан бараа бүтээгдэхүүнийг хүлээн
            авна. Үүнд: ЭЛЕКТРОМОНТАЖ ДЭЛГҮҮР –ийн үндсэн 3 салбар.
          </Text>
          <Text style={styles.paragraph}>
            3.3 Орон нутгийн хүргэлтийг тухайн орон нутаг руу тээврийн болон
            шуудангийн үйлчилгээ үзүүлдэг үйлчилгээний байгууллагаар хүргүүлнэ.
            Үйлчилгээний хөлс болон үүсэх эрсдэлийг Хэрэглэгч хариуцна.
          </Text>
          <Text style={styles.paragraph}>
            3.4 Хэрэглэгч бараа бүтээгдэхүүнийг хүлээн авах хаяг, холбоо барих
            утасны дугаараа /маш тодорхой/ үнэн зөв бөглөх үүрэгтэй ба буруу
            мэдээллээс болж үүдэн гарах зардал, алдагдлыг Хэрэглэгч хариуцна.
            Хүргэлт хийгдэх цагаар утсаа нээлттэй байлгах, хаяг дээрээ байх
            шаардлагатай.
          </Text>
          <Text style={styles.paragraph}>
            3.5 Хэрэглэгч барааг хүлээн авахдаа бичиг баримтаа хүргэлтийн
            ажилтанд шалгуулж бараагаа шалгаж хүлээн авна.
          </Text>
          <Text style={styles.paragraph}>
            3.6 Худалдан авалттай холбоотой дэлгэрэнгүй мэдээлэл Хэрэглэгчийн
            бүртгүүлсэн и-мэйл хаяг, бүртгүүлсэн гар утас руу тогтмол илгээгдэх
            ба Хэрэглэгч өөрийн захиалгын түүх дотроосоо харах боломжтой.
          </Text>
          <Text style={styles.paragraph}>
            3.7 Хүргэгдсэн бараа, бүтээгдэхүүнийг буцаах, солиулахтай холбоотой
            харилцааг тухайн нөхцлийн 6-р заалтанд зааснаар шийдвэрлэнэ
          </Text>
          <Text style={styles.paragraph}>
            3.8 Хэрэглэгч захиалгаа баталгаажуулсанаас хойш ажлын өдрүүдэд
            /24-48цаг/-ийн дотор хүргэлт хийгдэнэ.
          </Text>
          <Text style={styles.paragraph}>
            3.9 Хэрэглэгч захиалга очсоны дараа өөрийн биеэр хүлээн авах
            боломжгүй тохиолдолд орцны жижүүр, хотхоны жижүүр, хүнсний дэлгүүр,
            хөрш айл зэрэг тухайн байршилд үлдээх өөр хүлээн авагчыг зааж өгнө.
          </Text>
          <Text style={styles.heading}>4. Үнэ, төлбөр тооцоо</Text>
          <Text style={styles.paragraph}>
            4.1 WWW.EMONTAJ.MN нь захиалгын нийт үнийн дүнг 100 хувь урьдчилан
            хүлээн авснаар захиалга автоматаар баталгаажна. Хэрэглэгч бараа
            бүтээгдэхүүн, үйлчилгээний мэдээлэлтэй сайтар танилцаж, захиалгаа
            давхар нягтлах үүрэгтэй.
          </Text>
          <Text style={styles.paragraph}>
            4.2 WWW.EMONTAJ.MN -с худалдан авалт хийхдээ: Худалдаа хөгжлийн банк
            Хаан банк Голомт банк Хас банкуудийн картыг ашиглан гүйлгээ хийх
            боломжтой.
          </Text>
          <Text style={styles.paragraph}>
            4.3 Хэрэглэгч бүтээгдэхүүний төлбөр тооцоог дараах төрлүүдээр хийж
            болно: Дансаар Банкны картаар Qpay
          </Text>
          <Text style={styles.paragraph}>
            4.4 WWW.EMONTAJ.MN-н үнэ зөвхөн онлайн худалдааны /НӨАТ/-тэй үнэ
            болно.
          </Text>
          <Text style={styles.paragraph}>
            4.5 WWW.EMONTAJ.MN-с захиалсан бараа материалын дагуу нэхэмжлэх авч
            худалдан авалт хийх боломжтой. Нэхэмжлэхийн хүчинтэй хугацаа ажлын 5
            хоног.
          </Text>
          <Text style={styles.heading}> 5. Бараа материал хүлээлгэж өгөх</Text>
          <Text style={styles.paragraph}>
            5.1 Хүргэлтийн ажилтан бараа материалыг худалдан авагчид хүлээлгэн
            өгөхөөс өмнө бичиг баримтыг нь шалгана.
          </Text>
          <Text style={styles.paragraph}>
            5.2 Худалдан авсан бараа материалыг хүргэлтийн ажилтан бүрэн бүтэн
            байдал, иж бүрдэлийг нь сайтар шалган зарлагыг падаан, НӨАТ баримтын
            хамт худалдан авагчид хүлээлгэн өгнө.
          </Text>
          <Text style={styles.paragraph}>
            5.3 Худалдан авагч нь хүргэлтийн ажилтаны хамт барааны бүрэн бүтэн
            болоод иж бүрдлүүдийг сайтар шалгаж хүлээн авсны дараа хүргэлтийн
            хуудсанд гарын үсгээ зурна.
          </Text>
          <Text style={styles.paragraph}>
            5.4 Хүргэлтээр бараа очиход ажиллагааг нь шалгаж авна. Худалдан
            авагч нь гарын үсгээ зурж баталгаажуулснаас хойших механик гэмтлийг
            хүргэгч, худалдагч тал хариуцахгүй.
          </Text>
          <Text style={styles.paragraph}>
            5.5 Үйлдвэрийн гэмтэлтэй барааг асуудал гарсан тохиолдолд 24 цагийн
            дотор хариу мэдэгдэнэ.
          </Text>
          <Text style={styles.heading}>
            6. Бараа бүтээгдэхүүн буцаах, солих
          </Text>
          <Text style={styles.paragraph}>
            6.1 Хэрэглэгч захиалсан бараа бүтээгдэхүүнийг хүлээн авахдаа
            захиалсан хэмжээ, техникийн үзүүлэлт зөв эсэх, механик гэмтэл байгаа
            эсэхийг шалгаж авна.
          </Text>
          <Text style={styles.paragraph}>
            6.2 Хэрэглэгч захиалсан бараа бүтээгдэхүүнийг зохих ёсоор хүлээж
            авснаа хүлээн зөвшөөрч баримтад гарын үсэг зурсан тохиолдолд дараах
            тохиолдлуудаас бусад шалтгаанаар буцаах болон солиулах боломжгүй.
            Дараах тохиолдолд бараа бүтээгдэхүүнийг буцаах боломжтой. Үүнд:
            Захиалсан бараа гэмтэлтэй, зохих ёсоор бүрэн ажиллахгүй байсан. Энэ
            тохиолдолд барааг солиулах сонголт байх бөгөөд солих бараа байхгүй
            үед захиалгаа буцааж болно.
          </Text>
          <Text style={styles.paragraph}>
            6.3 Хэрэглэгч анх захиалгаа буруу үүсгэн баталгаажуулаж хүргэлт
            хүлээн авсан бол худалдан авсан барааг хүлээн авсан цагаас хойш 24
            цагийн дотор солиулах боломжтой. Солиулах барааг өөрийн биеэр
            буцаана.
          </Text>
          <Text style={styles.paragraph}>
            6.4 Бараа бүтээгдэхүүнийг буцаах/солиулахад тухайн худалдан авсан
            бараа бүтээгдэхүүний тооцооны хуудсыг үндэслэх ба бараа бүтээгдэхүүн
            нь дахин худалдаалах боломжтой байна.
          </Text>
          <Text style={styles.paragraph}>
            6.5 Сав баглаа боодлыг эвдэрч гэмтсэн, бохирдсон тохиолдолд солих
            болон буцаах боломжгүй.
          </Text>
          <Text style={styles.heading}>7. Бусад</Text>
          <Text style={styles.paragraph}>
            7.1 Худалдан авагчийн мэдээлэл болон төлбөрийн талаар ямар нэг
            асуудал эсвэл тодруулга гарвал хэрэглэгчийг утсанд болон имэйл рүү
            холбогдож лавлагаа авч болно.
          </Text>
          <Text style={styles.paragraph}>
            7.2 Сайтаас худалдан авалт хийж байгаа тохиолдолд Электромонтаж
            дэлгүүрийн бонус картын хөнгөлөлт хамаарагдахгүй.
          </Text>
          <Text style={styles.paragraph}>
            7.3 WWW.EMONTAJ.MN өдөр бүр 24 цагийн ажиллагаатай байх бөгөөд
            хүргэлтээс бусад үйлчилгээнүүд уг хугацаанд автоматаар хийгддэг
            байна.
          </Text>
          <Text style={styles.paragraph}>
            7.4 Хэрэглэгчийн оператор өдөр бүр 09.00-21.00 цаг хүртэл ажиллана.
          </Text>
          <Text style={styles.paragraph}>
            7.5 Хэрэгчийн санал хүсэлт, асуулт, лавлагааг Цахим шуудан:
            info@endless.mn Утас: 94050778
          </Text>
          <Text style={styles.appName}>МАНАЙХЫГ СОНГОСОНД БАЯРЛАЛАА</Text>
          <View style={styles.whiteSpace} />
        </View>
      </ScrollView>
    </>
  );
};

const styles = StyleSheet.create({
  appName: {
    textAlign: 'center',
    color: globalStyle.colorSecondary,
    fontWeight: '500',
    fontSize: 28,
    marginTop: 10,
  },
  container: {
    paddingHorizontal: 30,
    backgroundColor: globalStyle.colorIvory,
  },
  screenTitle: {
    textAlign: 'center',
    fontWeight: 'bold',
    marginVertical: 10,
    color: globalStyle.colorPrimary,
  },
  whiteSpace: {
    height: 100,
  },
  heading: {
    fontSize: 16,
    marginVertical: 5,
    fontWeight: 'bold',
    color: globalStyle.colorPrimary,
  },
  paragraph: {
    marginVertical: 5,
    color: globalStyle.colorPrimary,
  },
});
